Repository: 84000/data-translation-memory
Catalog: toh153_84000-the-questions-of-the-naga-king-sagara-1-.tmx
Source language: bo
Languages: en

source: །འགྲོ་བའི་ལས་ཀྱི་རྐྱེན་གྱིས་རང་བཞིན་འབྱུང་།
en: Their nature occurs through the conditioning of beings’ karma.

source: །ཕན་ཚུན་དུ་ནི་རྒྱུ་ལ་རྟེན་པར་འདུས།
en: They mutually combine in dependence on causes.

source: །དགེ་དང་མི་དགེའི་ལས་གང་བགྱིད་པ་དང་། །གང་ཞིག་བསྒོམས་དང་གང་ཞིག་མང་དུ་བགྱིས།
en: “No performance of virtuous or nonvirtuous actions, And no habituation or repetition,

source: །ཡུལ་ནམ་མཆིས་ཕྱོགས་ནམ་མཆིས་ཏེ། །ངོ་བོ་ཉིད་སྟོང་འོན་ཀྱང་རྣམ་པར་སྨིན།
en: Exist as objects in a particular location. Still, though their essence is empty, they do ripen.

source: །ནང་དང་སླད་རོལ་བར་ན་མི་གནས་ཏེ།
en: “They do not exist internally, externally, or in between,

source: །ཆོས་རྣམས་གང་དུའང་འཕུངས་པ་ཡོང་མ་མཆིས།
en: And there is no coming together of phenomena.

source: །དེ་དག་གང་ལའང་རྟེན་པ་མ་མཆིས་ལ།
en: They do not rely on anything anywhere,

source: །རྣམ་པར་སྨིན་པ་སླུ་བར་ཡོང་མི་བགྱིད།
en: Yet their ripening is unfailing.

source: །སྐྱེས་པ་མི་མངའ་འགག་པ་མངའ་མ་ལགས།
en: “They know no arising, no ceasing either.

source: །མཁས་པ་རྣམས་ནི་གོ་བར་བགྱི་སླད་དུ།
en: The learned, in order to bring understanding of this,

source: །ཉན་པ་ལ་ནི་སྨྲ་བས་ཚིག་ཀྱང་བསྟན།
en: Encourage listening, as they teach words,

source: །ལྟ་བ་རྣམ་པར་སྦྱང་བའི་སླད་དུ་བསྟན།
en: Teaching them in order to refine the view.

source: །གང་གི་འདུ་ཤེས་འདུ་ཤེས་ཅན་མ་མཆིས།
en: “There is no one with perceptions or anyone perceiving.

source: །མྱ་ངན་འདས་མཆིས་སུ་ཡང་ཞི་མ་མཆིས།
en: Within nirvāṇa there is no one passing into peace.

source: །སྐྱེ་བ་མ་མཆིས་མཐའ་གང་མཐའ་དེ་ལགས།
en: There is also no birth—any limit is a limit.

source: །བདག་གི་བདག་མེད་མཐའ་ནི་ནམ་མཁའི་མཐའ།
en: The limit of selflessness is the limit of space.

source: །ཀུན་གྱི་མཐའ་ནི་མཐའ་མཉམ་ཐོབ་པ་དེས།
en: “By achieving the complete limit, the limit of sameness,

source: །སངས་རྒྱས་བསམ་གྱིས་མི་ཁྱབ་དམ་པ་འཐོབ།
en: One will achieve sublime and unfathomable buddhahood.

source: །སྔོན་གྱི་མཐའ་དང་ཕྱི་མའི་མཐའ་དང་ནི།
en: The limits of the past, of the future,

source: །སྐྱེ་བའི་མཐའ་དང་སྐྱེ་བ་མ་མཆིས་མཐའ།
en: Of birth, and of non-birth— “All limits should be seen as identical in this light.

source: །མཐའ་ཀུན་དེ་ལྟར་མཉམ་པར་མཐོང་བ་དང་། །ཆགས་མེད་མཐའ་ཡི་སྒོ་ཤེས་ལྡན་པ་དང་། །དུས་གསུམ་མཐའ་རྣམས་ལ་ནི་མ་ཆགས་དེས།
en: Those who understand the gateway of the limit of nonattachment And who are unattached to the limits of the three times

source: །རྒྱལ་བ་རྣམས་ཀྱི་རིགས་མཆོག་ཐོབ་པར་འགྱུར།
en: Will achieve the supreme family of the victors.

source: །འགྲོ་བ་བཅིངས་ལས་རྣམ་པར་གྲོལ་མཛད་ནས།
en: “Liberating beings from their confinement,

source: །ཞི་མཆོག་མྱ་ངན་འདས་པ་བརྙེས་པར་འགྱུར།
en: They will attain the supreme peace of nirvāṇa.

source: །འགྲོ་ཀུན་རྨི་ལམ་ལྟ་བུར་དེས་གཟིགས་ནས།
en: By seeing all beings as dreams,

source: །འདིར་ནི་མིང་དང་གཟུགས་ལ་སེམས་མ་ཆགས།
en: They will be unattached to the names and forms of the world.

source: །ཆོས་ཀུན་ལས་ནི་རྣམ་པར་དག་པའི་མིག།
en: “The eyes that are purified of all phenomena

source: ཞི་བ་དང་ནི་མི་གཡོ་མི་འགུལ་འཐོབ།
en: Will achieve peace, unmoving and unwavering.

source: །ཆོས་རྣམས་ཐམས་ཅད་སྒྲ་མེད་སྐད་མེད་པ།
en: No phenomena can be described, verbalized,

source: །གཟུང་དུ་མེད་ཅིང་དངོས་མེད་རྣམ་པར་དག །དེ་བཞིན་རྒྱལ་བ་དམ་པ་རྣམས་ཀྱི་གདུང་།
en: Or perceived, because they are pure nonexistence. “The family lineage of the sublime thus-gone victors

source: །ཞི་བའི་ངོ་བོ་ཉིད་དེ་སྨོན་པ་སྤངས།
en: Is of the nature of peace and dispels all wishes;

source: །སྐྱོན་མེད་རིམས་ནད་མེད་ཅིང་མྱ་ངན་བྲལ།
en: It is without flaws and diseases and is free from anguish.

source: །སྤྲོས་ཀུན་ཉེ་བར་ཞི་ཞིང་བསམ་མི་ཁྱབ།
en: It quells all elaborations of thought and is unfathomable.

source: །རྒྱལ་བ་མཆོག་རྣམས་ཀྱི་ནི་ཆོས་འདི་དག །གཟུང་བྲལ་རང་བཞིན་སྒྲ་དང་སྐད་མ་མཆིས།
en: “These qualities of the supreme victors Are imperceptible, and they cannot be described or verbalized.

source: །འགྲོ་ལ་སྨན་སླད་སྐྱེས་བུ་དམ་པ་ཡིས།
en: Yet to benefit others, sublime beings

source: །དེ་ཡང་ཡི་གེ་རྣམས་ཀྱིས་གླེང་ཞིང་བསྟན།
en: Speak and teach even in our own languages.

source: །གང་གིས་འཇིག་རྟེན་བླ་མར་རང་འབྱུང་མཐོང་།
en: “Whoever sees the world as a natural teacher

source: །མཐོང་ནས་ཀྱང་ནི་ཡིད་ལ་དད་བགྱིད་དང་། །ཁྱད་པར་འགྲོ་བའི་ཆོས་ཀྱང་ཉན་པ་ཡི།
en: And further develops faith—

source: །ལྷ་དང་མི་རྣམས་རྙེད་པ་ལེགས་པར་རྙེད།
en: Such gods and humans who hear the extraordinary Dharma Gain a great boon. “This Dharma is proclaimed by the guides of the world

source: །ཕྱོགས་དང་ཕྱོགས་མཚམས་རྣམས་སུ་ཆོས་འདི་ནི། །འཇིག་རྟེན་རྣམ་པར་འདྲེན་པས་རབ་ཏུ་བསྟན།
en: Throughout the cardinal and intermediate directions.

source: །གང་དག་མ་འོངས་སངས་རྒྱས་འགྱུར་བ་རྣམས།
en: Those buddhas who will manifest in the future

source: །ཐམས་ཅད་ཀྱང་ནི་མཉམ་པའི་ཆོས་སུ་འགྱུར།
en: Will all have the same qualities.

source: །སྒྲ་རྣམས་ཐམས་ཅད་བྲག་ཅ་ཙམ་དུ་བས།
en: “All sound is merely echoes.

source: །དེ་ནི་བརྗོད་ན་རྣ་བར་གྲག་པར་འགྱུར།
en: As words are spoken, they are heard by the ear.

source: །དེ་ནི་ཚུལ་བཞིན་ལམ་གྱི་རྒྱུད་འགྱུར་ཏེ།
en: They can become the cause of the proper path,

source: །ཆོས་སོ་འཚལ་གྱི་སླད་དུ་བཏགས་པ་ཙམ།
en: Which is called Dharma in order to generate understanding.

source: །ཆོས་ཀུན་སྒྱུ་མ་འདྲ་ཞིང་གསོག་ལགས་ཏེ།
en: “All things are illusory and hollow.

source: །དེ་དག་སེམས་ཅན་སླད་དུ་རྣམ་པར་ཕྱེ།
en: They are discerned for the sake of beings,

source: །དེ་དག་རང་བཞིན་ངོ་བོ་གང་ཡིན་པ།
en: Yet the nature of these things

source: །དེ་ནི་ནམས་ཀྱང་རྣམ་པར་དབྱེར་མི་རུང་།
en: Could never be divided. “If the noble ones train with the Teacher,

source: །འཇིག་རྟེན་ན་ནི་སངས་རྒྱས་ཆོས་རྒྱལ་མཆོག །ཆོས་ཀྱི་དབང་ཕྱུག་ཀུན་རིག་ཀུན་མཁྱེན་པ། །སྟོན་པ་དེ་ལ་སློབ་ན་དེ་བཞིན་དུ།
en: The Buddha, the supreme Dharma king of the world, The aware and knowledgeable Lord of Dharma,

source: །འཕགས་པ་ཀུན་གྱིས་དེ་ཉིད་དོན་ཀྱང་རྟོགས།
en: They will also accordingly realize the meaning of reality.

source: །བྱུང་བ་གང་ལགས་པ་དང་ད་ལྟར་དང་། །མ་འོངས་པ་ན་འབྱུང་བ་གང་ལགས་པ།
en: “What arose in the past, what arises now, And what will arise in the future—

source: །ཐམས་ཅད་ལ་ཡང་ཐུབ་པ་སྐྱེས་མཆོག་གི།
en: The wisdom of the sage, the supreme being,

source: །ཡེ་ཤེས་འཇུག་སྟེ་ཐོགས་པ་ཡོང་མི་མངའ།
en: Perceives all of that without impediment.

source: །སྐྱེས་བུ་དམ་པ་དེ་ཡིས་དེ་རིང་བདག །དོགས་མ་མཆིས་པར་བྱང་ཆུབ་མཆོག་ལུང་བསྟན།
en: “The Sublime Being has today given me A definite prophecy of supreme awakening.

source: །བདག་ནི་འགྲོ་ལ་ཕན་ཕྱིར་སངས་རྒྱས་འགྱུར།
en: I will become a buddha for the benefit of beings.

source: །བདག་ལ་སོམ་ཉི་མ་མཆིས་དོགས་མ་མཆིས།
en: I have no doubt or hesitation about this.”

source: །ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་ཡོངས་སུ་དག་པའི་ལེའུ་སྟེ་དགུ་པའོ།།
en: Chapter Nine: The Inherent Purity of All Phenomena

source: །།དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཐམས་ཅད་ལ་བཀའ་སྩལ་པ། སྐྱེས་བུ་དམ་པ་ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པའི་བྱང་ཆུབ་ཅི་ནས་ཡུན་རིང་དུ་གནས་པར་བྱ་བའི་ཕྱིར་མདོ་སྡེ་འདི་ཟུང་ཤིག །ཁྱོད་ཀྱི་ནང་ནས་སུ་དག་མདོ་སྡེ་འདི་ལྟ་བུ་འདི་དག་གཟུང་བར་སྤྲོ།
en: The Blessed One then addressed all the bodhisattvas, saying, “Sublime beings, you must uphold this sūtra to ensure that the Thus-Gone One’s awakening will remain for a long time. Who among you is enthusiastic about upholding this sūtra?”

source: དེ་ནས་དེར་བྱང་ཆུབ་སེམས་དཔའ་ཉི་ཁྲི་དང་ལྷའི་བུ་ཁྲི་སྟན་ལས་ལངས་ཏེ།
en: Twenty thousand bodhisattvas and ten thousand gods then rose from their seats.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ཅག་གིས་མདོ་སྡེ་འདི་ལྟ་བུ་འདི་དག་གཟུང་བར་འཚལ་ལོ།
en: Bowing with palms joined toward the Blessed One, they said, “Blessed One, we commit to upholding this sūtra in this way.

source: །རྒྱས་པར་ཡང་བགྱིའོ།
en: We will propagate it.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་ཁྱེད་ཀྱིས་ཆོས་བསྒྲུབ་པ་ཇི་ལྟ་བུས་དེ་བཞིན་གཤེགས་པའི་བྱང་ཆུབ་འདི་འཛིན་པར་བྱེད།
en: The Blessed One asked, “Noble children, through what manner of Dharma practice will you uphold the Thus-Gone One’s awakening?”

source: དེ་ནས་དེར་བྱང་ཆུབ་སེམས་དཔའ་ཡེ་ཤེས་རྒྱལ་མཚན་ཏོག་ཅེས་བྱ་བ་དེས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་གིས་དམ་པའི་ཆོས་གཟུང་བར་འཚལ་ན། ཅི་བདག་དེ་བཞིན་གཤེགས་པའི་བྱང་ཆུབ་འཛིན་པ་ལགས་སམ།
en: The bodhisattva Crest of the Wisdom Banner then asked the Blessed One, “Blessed One, if I commit to upholding the sublime Dharma, am I upholding the Thus-Gone One’s awakening?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་ཁྱོད་དེ་ལྟར་སྒྲུབ་ན་དེ་བཞིན་གཤེགས་པའི་བྱང་ཆུབ་འཛིན་པ་ཡང་དག་པ་ཡིན་ནོ།
en: The Blessed One said, “Noble son, if you practice in that manner, you are truly upholding the Thus-Gone One’s awakening.”

source: །བྱང་ཆུབ་སེམས་དཔའ་མཉམ་པར་ལྟས་གསོལ་པ། བཅོམ་ལྡན་འདས་བདག་གིས་མཚམས་མ་མཆིས་པ་མཉམ་པ་ཉིད་ཀྱིས་བྱང་ཆུབ་མཉམ་པ་ཉིད་དུ་མཐོང་ན། ཅི་བདག་དེ་བཞིན་གཤེགས་པའི་བྱང་ཆུབ་འཛིན་པ་ལགས་སམ། བཀའ་སྩལ་པ།
en: The bodhisattva Impartial Gaze asked, “Blessed One, if I see awakening as sameness through the view of unbounded sameness, am I upholding the Thus-Gone One’s awakening?”

source: རིགས་ཀྱི་བུ་ཁྱོད་དེ་ལྟར་སྒྲུབ་ན་ངའི་བྱང་ཆུབ་འཛིན་པ་ཡང་དག་པ་ཡིན་ནོ།
en: The Blessed One said, “Noble son, if you practice in that manner, you are truly upholding my awakening.”

source: །བྱང་ཆུབ་སེམས་དཔའ་ལྟ་བ་མེད་ཀྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་བདག་གིས་སོ་སོའི་སྐྱེ་བོའི་ཆོས་རྣམས་ཀྱང་མ་མཐོང་། སློབ་པའི་ཆོས་དང་། མི་སློབ་པའི་ཆོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཆོས་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཆོས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱང་མ་མཐོང་ན། ཅི་བདག་དེ་བཞིན་གཤེགས་པའི་བྱང་ཆུབ་འཛིན་པ་ལགས་སམ། བཀའ་སྩལ་པ།
en: The bodhisattva No View asked, “Blessed One, if I do not see the phenomena of ordinary beings, of those in training, of those beyond training, solitary buddhas, bodhisattvas, or buddhas, am I upholding the Thus-Gone One’s awakening?”

source: རིགས་ཀྱི་བུ་དེ་ནི་དེ་བཞིན་ནོ།
en: “Yes, noble son, that is so.”

source: །བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཐམས་ཅད་ལ་ཁས་འཆེ་བ་མེད་པར་ཤིན་ཏུ་གནས་པས་གསོལ་པ། བཅོམ་ལྡན་འདས་བདག་གིས་ཆོས་ཀྱི་རང་བཞིན་ཅི་ཡང་མ་འཚལ་ཅིང་མི་འཛིན་ན། ཅི་བདག་དམ་པའི་ཆོས་འཛིན་པ་ལགས་སམ། བཀའ་སྩལ་པ།
en: The bodhisattva All Phenomena Abide without Assertions asked, “Blessed One, if I do not cling or grasp to any nature in phenomena, am I upholding the sublime Dharma?”

source: །བྱང་ཆུབ་སེམས་དཔའ་མིག་མི་འཛུམས་ཀྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་བདག་མིག་གིས་མི་ལྟ། སེམས་ཀྱིས་མི་གཏོད། དྲན་པ་མི་སྐྱེད་ན། ཅི་བདག་དམ་པའི་ཆོས་འཛིན་པ་ལགས་སམ།
en: The bodhisattva Unwinking Gaze asked, “Blessed One, if I do not see with the eyes, focus with the mind, or arouse mindfulness, am I upholding the sublime Dharma?”

source: བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དེ་ནི་དེ་བཞིན་ནོ།
en: “Yes, noble son, that is so.”

source: །བྱང་ཆུབ་སེམས་དཔའ་བརྗོད་དུ་མེད་པས་གསོལ་པ། བཅོམ་ལྡན་འདས་བདག་ཆོས་ཀྱང་མི་སྟོན། ཆོས་མ་ལགས་པ་ཡང་མི་སྟོན། བདག་ལས་ཆོས་ཀྱི་སྒྲ་ཡང་མི་འབྱུང་། ཆོས་ཀྱི་འདུ་ཤེས་པ་ཡང་རྟོག་པར་མི་བགྱིད་ན། ཅི་བདག་དམ་པའི་ཆོས་འཛིན་པ་ལགས་སམ།
en: The bodhisattva Inexpressible asked, “Blessed One, if I do not teach the Dharma or even non-Dharma, if the sound of Dharma is not even heard from me, and if I do not even hold any notions of the Dharma, am I upholding the sublime Dharma?”

source: །བྱང་ཆུབ་སེམས་དཔའ་མིང་མེད་པས་གསོལ་པ། བཅོམ་ལྡན་འདས་བདག་གང་གི་མིང་དང་མཚན་མ་ཡང་མི་ཉན་ལགས་ན། ཅི་བདག་དམ་པའི་ཆོས་འཛིན་པ་ལགས་སམ། བཀའ་སྩལ་པ།
en: The bodhisattva Nameless asked, “Blessed One, if I do not hear any names or marks, am I upholding the sublime Dharma?”

source: །བྱང་ཆུབ་སེམས་དཔའ་ནམ་མཁའི་མཛོད་ཀྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་བདག་གིས་ཆོས་ཐམས་ཅད་ནམ་མཁའི་ངོ་བོ་ཉིད་དུ་རིག་ནས་གང་ལ་འཛིན་པའི་ཆོས་རྣམས་དང་། ཆོས་མ་ལགས་པ་རྣམས་མི་མཐོང་ན། ཅི་བདག་དམ་པའི་ཆོས་འཛིན་པ་ལགས་སམ། བཀའ་སྩལ་པ།
en: The bodhisattva Treasury of Space asked, “Blessed One, if I understand that all phenomena have the essence of space, and I subsequently do not see any phenomena or non-phenomena that one can grasp at, am I upholding the sublime Dharma?”

source: །བྱང་ཆུབ་སེམས་དཔའ་མི་གཡོ་བའི་སྟབས་ཀྱིས་འགྲོ་བས་གསོལ་པ། བཅོམ་ལྡན་འདས་བདག་ཆོས་ཐམས་ཅད་ལ་མི་དམིགས་མི་གཡོ་མངོན་པར་ཞེན་པ་མ་མཆིས་ན། ཅི་བདག་དམ་པའི་ཆོས་འཛིན་པ་ལགས་སམ།
en: The bodhisattva Moves with the Unmoving Stride asked, “Blessed One, if I do not observe, do not cling to, and remain unmoved by any phenomena, am I upholding the sublime Dharma?”

source: །བྱང་ཆུབ་སེམས་དཔའ་བདུད་འཇོམས་ཀྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་བདག་སངས་རྒྱས་ཀྱི་ཡུལ་ལ་བདུད་ཀྱི་ཡུལ་གྱི་རྗེས་སུ་མཆིས་ལ། བདུད་ཀྱི་ཡུལ་ལ་ཡང་སངས་རྒྱས་ཀྱི་ཡུལ་གྱི་རྗེས་སུ་མཆི་ན། ཅི་བདག་དམ་པའི་ཆོས་འཛིན་པ་ལགས་སམ། བཀའ་སྩལ་པ།
en: The bodhisattva Defeater of Māra asked, “Blessed One, if I perceive the domain of the māras within the domain of the buddhas, and the domain of the buddhas within the domain of the māras, am I upholding the sublime Dharma?”

source: །བྱང་ཆུབ་སེམས་དཔའ་རྡོ་རྗེའི་སྟབས་ཀྱིས་འགྲོ་བས་གསོལ་པ། བཅོམ་ལྡན་འདས་གང་ཆོས་ཀྱི་དབྱིངས་ཀྱང་འབྱེད་པར་མི་བགྱིད། སེམས་ཅན་ཁམས་ལ་མ་གཏོགས་པར་ཡང་ཆོས་ཀྱི་དབྱིངས་ལ་འཇུག་པར་མི་བགྱིད་ན། ཅི་དེ་དམ་པའི་ཆོས་འཛིན་པ་ལགས་སམ།
en: The bodhisattva Moves with the Vajra Stride asked, “Blessed One, if I do not divide the realm of phenomena and do not perceive the realm of phenomena as being apart from the element of beings, am I upholding the sublime Dharma?”

source: །བྱང་ཆུབ་སེམས་དཔའ་མི་དམིགས་པས་གསོལ་པ། བཅོམ་ལྡན་འདས་གང་ཆོས་ཅི་ཡང་མི་དམིགས་ལ། བ་སྤུའི་ཁུང་བུ་ཐམས་ཅད་ནས་ཀྱང་ཆོས་ཀྱི་སྒྲ་འབྱུང་ན། ཅི་དེ་དམ་པའི་ཆོས་འཛིན་པ་ལགས་སམ། བཀའ་སྩལ་པ།
en: The bodhisattva Unobserving asked, “Blessed One, if I do not observe any Dharma, yet the sound of Dharma emerges from every pore of my skin, am I upholding the sublime Dharma?”

source: །བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ནས་བསྲུངས་པས་གསོལ་པ། བཅོམ་ལྡན་འདས་གང་བདུད་ཀྱི་ཞགས་པས་ཀྱང་མ་བཅིངས་ལ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་ཡང་སྤྱོད་ན། ཅི་དེ་དམ་པའི་ཆོས་འཛིན་པ་ལགས་སམ།
en: The bodhisattva Total Protection asked, “Blessed One, if I engage in the conduct of bodhisattvas while not bound by Māra’s lasso, am I upholding the sublime Dharma?”

source: །བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་རྒྱ་མཚོས་གསོལ་པ། བཅོམ་ལྡན་འདས་གང་ཆོས་ཐམས་ཅད་རྒྱ་མཚོའི་ཕྱག་རྒྱས་ཡང་དག་པར་འདུ་བ་དང་། རྣམ་པར་གྲོལ་བའི་ངོ་བོ་ཉིད་རོ་གཅིག་པར་འཚལ་ན། ཅི་དེ་དམ་པའི་ཆོས་འཛིན་པ་ལགས་སམ། བཀའ་སྩལ་པ།
en: The bodhisattva Sāgaramati asked, “Blessed One, if I understand that all phenomena are contained within the ocean seal and that they have one taste with the essence of liberation, am I upholding the sublime Dharma?”

source: རིགས་ཀྱི་བུ་དེ་ནི་དེ་བཞིན་ནོ། །ལྷའི་བུ་མཚན་བཟང་གིས་གསོལ་པ།
en: “Yes, noble son, that is so.”

source: བཅོམ་ལྡན་འདས་གང་སྐྱེ་ཡང་སྐྱེ་ལ། ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་རྣམས་འབྱུང་བ་ཡང་མི་འཛིན། འབྱུང་ཡང་འབྱུང་ལ། དེ་སེམས་དང་ཡིད་དུ་འདོགས་པར་ཡང་མི་བགྱིད་ན། ཅི་དེ་དམ་པའི་ཆོས་འཛིན་པ་ལགས་སམ།
en: The god Excellent Mark asked, “Blessed One, if I do not grasp what is born to be the aggregates, elements, and sense sources, and if I do not conceive of what arises to be the mind and consciousness, am I upholding the sublime Dharma?”

source: བཀའ་སྩལ་པ། ལྷའི་བུ་དེ་ནི་དེ་བཞིན་ནོ།
en: “Yes, god, that is so.”

source: །ལྷའི་བུ་དྲི་མ་མེད་པས་གསོལ་པ། བཅོམ་ལྡན་འདས་གང་ཆོས་ཐམས་ཅད་དྲི་མ་མ་མཆིས་པ་དང་། སྙིགས་མ་མ་མཆིས་པ་དང་། འདོད་ཆགས་ཀྱི་རྡུལ་དང་བྲལ་བར་རིག་ནས། རྒྱུ་ལས་རྣམ་པར་གྲོལ་བར་མི་བགྱིད་ན། ཅི་དེ་དམ་པའི་ཆོས་འཛིན་པ་ལགས་སམ།
en: The god Stainless asked, “Blessed One, if I know all phenomena to be immaculate, without impurities, and free from the dust of desire, and I thus do not seek liberation from causes, am I upholding the sublime Dharma?”

source: །ལྷའི་བུ་སེམས་ཅན་སྒྲོལ་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་གང་སེམས་ཅན་རྣམས་ཀྱང་སྒྲོལ་བར་བགྱིད་ལ། བདག་མ་མཆིས་པ་ཡང་འཚལ།
en: The god Liberator of Beings asked, “Blessed One, I liberate beings and understand the absence of self.

source: བསྒྲལ་ནས་ཀྱང་འཛུད་པར་བགྱིད་ལ། ཚུ་རོལ་དང་ཕ་རོལ་གྱི་འགྲམ་ན་ཡང་མི་གནས་ན།
en: Though I liberate others and establish them in that state, I do not abide on the near or far shore.

source: ཅི་དེ་དམ་པའི་ཆོས་འཛིན་པ་ལགས་སམ།
en: Am I thus upholding the sublime Dharma?”

source: །ལྷའི་བུ་དབང་བྱེད་ཀྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་གང་ཆོས་ཐམས་ཅད་ལ་དབང་ཡང་ཐོབ་ལ།
en: The god Omnipotent asked, “Blessed One, I have achieved power over all phenomena.

source: ཆོས་གང་ཡང་སྐྱེ་བར་ཡང་མི་བགྱིད། འགག་པར་ཡང་མི་བགྱིད་ན། ཅི་དེ་དམ་པའི་ཆོས་འཛིན་པ་ལགས་སམ།
en: If I do not produce or block any phenomena, am I upholding the sublime Dharma?”

source: །ལྷའི་བུ་རྒྱལ་པོ་བཟང་གིས་གསོལ་པ། བཅོམ་ལྡན་འདས་གང་སེམས་ཅན་ཐམས་ཅད་སེམས་ཅན་མཉམ་པ་དང་། ཆོས་ཐམས་ཅད་ཆོས་མཉམ་པ་དང་། ཞིང་ཐམས་ཅད་ཞིང་མཉམ་པ་དང་། སངས་རྒྱས་ཐམས་ཅད་སངས་རྒྱས་མཉམ་པར་རྗེས་སུ་སོང་ན། ཅི་དེ་དམ་པའི་ཆོས་འཛིན་པ་ལགས་སམ། བཀའ་སྩལ་པ།
en: The god Excellent King asked, “Blessed One, if to me all beings are the sameness of beings, all phenomena are the sameness of phenomena, all fields are the sameness of fields, and all buddhas are the sameness of buddhas, am I upholding the sublime Dharma?”

source: ལྷའི་བུ་དེ་ནི་དེ་བཞིན་ནོ། །ལྷའི་བུ་ལེགས་པར་སེམས་ཀྱིས་གསོལ་པ།
en: “Yes, god, that is so.”

source: བཅོམ་ལྡན་འདས་བདག་ཆོས་ཅི་ཡང་མི་སེམས་ཤིང་སྤྲོས་པར་མི་བགྱིད་དེ། མཚན་མར་མི་བགྱིད་ན། ཅི་བདག་དམ་པའི་ཆོས་འཛིན་པ་ལགས་སམ། བཀའ་སྩལ་པ།
en: The god High Minded asked, “Blessed One, if I do not conceptualize any phenomena, elaborate upon them, or objectify them, am I upholding the sublime Dharma?”

source: ལྷའི་བུ་དེ་ནི་དེ་བཞིན་ནོ། །སྲིང་མོ་ཨུད་པ་ལས་གསོལ་པ།
en: “Yes, god, that is so.”

source: བཅོམ་ལྡན་འདས་བདག་ཆོས་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ལགས་པར་འཚལ་ལ། འོན་ཀྱང་བདག་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱ་ན། ཅི་བདག་དམ་པའི་ཆོས་འཛིན་པ་ལགས་སམ། བཀའ་སྩལ་པ།
en: The lady Utpalā asked, “Blessed One, if I do not fully awaken to buddhahood though I well understand all phenomena to be qualities of buddhahood, am I upholding the sublime Dharma?”

source: སྲིང་མོ་དེ་ནི་དེ་བཞིན་ནོ། །བུ་མོ་མུ་ཏིག་ཕྲེང་གིས་གསོལ་པ།
en: “Yes, lady, that is so.”

source: བཅོམ་ལྡན་འདས་བདག་གིས་བུད་མེད་ཀྱི་ཆོས་རྣམས་ཀྱང་མི་དམིགས། སྐྱེས་པའི་ཆོས་རྣམས་ཀྱང་མི་དམིགས་ཏེ།
en: The lady Pearl Garland asked, “Blessed One, I do not observe female qualities on the one hand or male qualities on the other.

source: སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་མཚན་ཉིད་གང་ལགས་པ་དེ་བུད་མེད་དང་། སྐྱེས་པའི་ཆོས་རྣམས་ཀྱི་མཚན་ཉིད་ལགས་ལ།
en: The characteristics of the qualities of buddhahood are the very characteristics of female and male qualities.

source: ཆོས་དེ་དག་ཀྱང་ཆོས་ཀྱང་མ་ལགས། ཆོས་མ་ལགས་པ་ཡང་མ་ལགས་ཏེ།
en: Such qualities are not even qualities, nor are they nonqualities.

source: དེའི་སླད་དུ་འདི་ལྟར་བདག་ནི་སྐྱེད་པར་ཡང་མི་བགྱིད། ཁས་ལེན་པར་ཡང་མི་བགྱིད་ན། ཅི་བདག་དམ་པའི་ཆོས་འཛིན་པ་ལགས་སམ། བཀའ་སྩལ་པ།
en: For this reason, if I do not create or accept anything, am I upholding the sublime Dharma?”

source: བུ་མོ་དེ་ནི་དེ་བཞིན་ནོ།
en: “Yes, lady, that is so.”

source: །བུ་མོ་རིན་ཆེན་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་བདག་གིས་བྱང་ཆུབ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡང་མ་མཐོང་ལ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་གོ་ཆ་ཡང་བདག་གིས་བགོས།
en: The lady Ratnā asked, “Blessed One, I do not see either awakening or bodhisattva conduct, yet I don the armor for all beings.

source: དེ་དག་ཀྱང་གཏན་དུ་བདག་གིས་མ་མཐོང་ན། ཅི་བདག་དམ་པའི་ཆོས་འཛིན་པ་ལགས་སམ།
en: If I never see them, am I upholding the sublime Dharma?”

source: བཀའ་སྩལ་པ། བུ་མོ་དེ་ནི་དེ་བཞིན་ནོ། །བུ་མོ་དྲི་མ་མེད་པའི་འོད་ཀྱིས་གསོལ་པ།
en: “Yes, lady, that is so.”

source: བཅོམ་ལྡན་འདས་བདག་ཆོས་ཐམས་ཅད་ལ་ཡང་ཆོས་ཀྱི་འདུ་ཤེས་མི་སྐྱེད་ལ།
en: The lady Vimalaprabhā asked, “Blessed One, I do not entertain the notion that any phenomena are phenomena.

source: སེམས་ཅན་ཐམས་ཅད་ལ་ཡང་སེམས་ཅན་གྱི་འདུ་ཤེས་མི་སྐྱེད།
en: I also do not entertain the notion that any beings are beings.

source: ཆོས་ཐམས་ཅད་ཀྱིས་ཀྱང་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ལ་རྣམ་པར་མི་རྟོག་སྟེ། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་ཁོངས་སུ་ཡང་ཆོས་ཐམས་ཅད་འདུས་པར་ཡང་དག་པར་མཐོང་ལ།
en: All phenomena together cannot be viewed as the qualities of buddhahood, for all phenomena are truly seen to be subsumed within the qualities of buddhahood.

source: དེ་དག་གི་ཁོངས་སུ་ཡང་མ་ཞེན་པར་ཡང་དག་པར་མཐོང་ན། བཅོམ་ལྡན་འདས་བདག་དེ་ལྟར་བརྩོན་ན། ཅི་དམ་པའི་ཆོས་འཛིན་པ་ལགས་སམ།
en: If they are truly seen as such without clinging, and, Blessed One, if I endeavor in this way, am I upholding the sublime Dharma?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། བུ་མོ་ཁྱོད་དེ་ལྟར་སྒྲུབ་ན་དམ་པའི་ཆོས་འཛིན་པ་ཡང་དག་པ་ཡིན་ནོ།
en: The Blessed One answered, “Lady, if you practice in that manner, you are truly upholding the sublime Dharma.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འདི་ལྟར་བསམ་གྱིས་མི་ཁྱབ་པའི་ཆོས་རྣམ་པར་ངེས་པའི་སྤོབས་པ་དང་ལྡན་པའི་བུ་མོ་རྣམས་ཀྱིས་འདིར་རྣམ་པ་དང་སྒྲ་དང་བརྡ་སྣ་ཚོགས་ཀྱིས་ཆོས་ཉིད་དེ་ཁོ་ན་གླེངས་ཏེ། ཆོས་གང་དང་ཡང་འགལ་བར་མི་བགྱིད་ལ།
en: Then Śakra, lord of the gods, remarked to the Blessed One, “Blessed One, these women who have such precise eloquence with regard to the unfathomable Dharma have here discussed reality in terms of its various perspectives, words, and conventions, all without contradicting the Dharma at all.

source: ཆོས་ཐམས་ཅད་ཀྱང་བྱང་ཆུབ་དང་མཉམ་པ་ཉིད་དུ་སྟོན་པ་ནི་ངོ་མཚར་ལགས་སོ།
en: How amazing to hear them describe all phenomena as being identical to awakening.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀཽ་ཤི་ཀ་གཞན་ཡང་ཆོས་དེ་ནི་དེ་བཞིན་ཏེ།
en: The Blessed One responded, “Kauśika, the Dharma is like that.

source: བུ་མོ་འདི་དག་ནི་བསམ་གྱིས་མི་ཁྱབ་པའི་ཆོས་རྣམ་པར་ངེས་པ་སྟོན་པ་ལ་མཁས་པ།
en: These women are skilled in teaching the unfathomable Dharma.

source: སངས་རྒྱས་མང་པོ་ལ་བསྙེན་བཀུར་བྱས་པ། བཟོད་པ་ཐོབ་པ་ཤ་སྟག་གོ།
en: Each of them has served many buddhas and attained acceptance.

source: །ཀཽ་ཤི་ཀ་གཞན་ཡང་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་གཟུང་བ་དང་། གཞན་དག་ལ་ཡང་རྒྱས་པར་བསྟན་པ་དང་། དེ་བཞིན་གཤེགས་པ་མྱ་ངན་ལས་འདས་པའི་འོག་ཏུ་ཡང་མ་འོངས་པའི་སེམས་ཅན་ཆེན་པོ་དམ་པའི་ཆོས་ཀྱི་གྲོང་ཁྱེར་བསྲུང་བ་དེ་དག་ལ་བསྟབས་པའི་ཕྱིར་ཁྱོད་ལ་གཏད་དོ།
en: Kauśika, nevertheless I entrust you with the responsibility for upholding this Dharma teaching, propagating it to others, and, after the Thus-Gone One’s nirvāṇa, caring for great beings of the future and protecting the city of the sublime Dharma.

source: །དེ་ལྟར་བྱས་ན་ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པའི་མཆོག་བྱས་པར་འགྱུར་རོ།
en: If you do this, you will have performed the highest veneration of the Thus-Gone One.”

source: །བརྒྱ་བྱིན་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བདག་གིས་གཟུང་ལགས་སོ།
en: Śakra responded, “Blessed One, I will uphold this Dharma teaching.

source: །འདི་ནི་བདག་གིས་དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་ཁོ་ནས་རྒྱས་པར་བགྱིའོ།
en: I will propagate it solely through the blessings of the Thus-Gone One.

source: །མ་འོངས་པའི་སེམས་ཅན་ཆེན་པོ་དེ་དག་ལ་ཡང་བསྟབས་པར་འཚལ་ལོ།
en: I take responsibility for caring for the great beings of the future.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན་བཅོམ་ལྡན་འདས་བདག་གིས་ནི་དེ་བཞིན་གཤེགས་པ་ལ་བཀའ་དྲིན་བསབས་པའི་རྔོ་མི་ཐོགས་ཏེ།
en: Why do I say this? Because, Blessed One, I have been unable to repay the kindness of the Thus-Gone One.

source: འདི་ལྟར་བདག་ནི་དེ་བཞིན་གཤེགས་པའི་ཆོས་ཀྱིས་ཕན་གདགས་པའི་སླད་དུའོ།
en: Also, I wish to bring benefit with the teachings of the Thus-Gone One.

source: །བཅོམ་ལྡན་འདས་གཞན་ཡང་ཅི་ནས་བདུད་དང་། ཕྱིར་རྒོལ་བ་ངེས་པར་བཅོམ་ནས་འདི་འཛམ་བུའི་གླིང་དུ་སྤྱོད་པར་འགྱུར་བ་དེ་ལྟ་བུར་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་དེ་བཞིན་གཤེགས་པས་བྱིན་གྱིས་བརླབ་ཏུ་གསོལ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Moreover, Blessed One, could the Thus-Gone One please bless this Dharma teaching so that it may conquer all māras and hostile assaults and flourish here in Jambudvīpa?”

source: ཀཽ་ཤི་ཀ་དེའི་ཕྱིར་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་། བར་དུ་གཅོད་པ་ཐམས་ཅད་རྣམ་པར་སྦྱོང་བ་ཞེས་བྱ་བའི་རིག་སྔགས་དང་། གསང་སྔགས་ཀྱི་གཞིའི་བྱིན་བརླབ་ངས་བསྟན་པར་བྱ་སྟེ།
en: The Blessed One said, “In that case, Kauśika, please listen well and bear in mind what I say. I will now declare the blessed words of the mantra, the secret mantra, called purifying all obstructors

source: རིག་སྔགས་དང་། གསང་སྔགས་ཀྱི་གཞི་དེ་དག་གིས་བདུད་ཐམས་ཅད་དང་། ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་ཀྱང་ཤིན་ཏུ་ཚར་གཅོད་པར་འགྱུར་ལ་དེ་བཞིན་གཤེགས་པའི་ཆོས་ཀྱི་སྒྲོན་མ་འདི་ཡང་ཡུན་རིང་དུ་གནས་པར་འགྱུར་རོ། །ཏདྱ་ཐཱ། ཨ་བྷ་ཡེ། བྷ་ཡ་བི་ག་ཏེ། བྷ་ཡ་བི་ཤོ་དྷ་ནེ། ཨ་བྷ་ཡ་དཱ་དེ། ནི་རུ་པ་དྲ་བེ། ཨ་ནཱ་ཀུ་ལེ། ཨཱ་ཀུ་ལ་སཾ་ཤོ་དྷ་ནེ། ཨ་གྲ་ཧེ། ཨ་བི་བཱ་དེ། ཨ་ཀལྤེ། ཨ་ཙྱུཏྟེ། ཤུ་བྷ་ཏེ་ཛེ། ཏེ་ཛོ་བ་ཏི། མ་ཧཱ་ཏེ་ཛེ། ཨུ་པ་ཤཱ་མེ། མཻ་ཏྲྱུངྒ་ཏེ། ཤོ་ཥ་ཡ་མཱ་ནེ། སཏྱ་དརྵ་ཎེ།
en: Through these words of the mantra, the secret mantra, all māras and obstructors will be destroyed, and the Thus-Gone One’s lamp of Dharma will last for a long time:
